examples/coOptimiseChannelAndBody/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1920
(
0.00075
0.00225
0.00375
0.00525
0.00675
0.00825
0.00975
0.01125
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 8(0.12 0.12 0.12 0.12 0.12 0.12 0.12 0.12);
    }
    heatedSurface
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.00075
0.00225
0.00375
0.00525
0.00675
0.00825
0.00975
0.01125
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.00075
0.00225
0.00375
0.00525
0.00675
0.00825
0.00975
0.01125
...
)
;
    }
    endWalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
0
0
0
0
0.12
0.12
0.12
0.12
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
