examples/coOptimiseChannelAndBody/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1920
(
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 8(0.0085 0.0095 0.0105 0.0115 0.0125 0.0135 0.0145 0.0155);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 8(0.0085 0.0095 0.0105 0.0115 0.0125 0.0135 0.0145 0.0155);
    }
    heatedSurface
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.024
0.024
0.024
0.024
0.024
0.024
0.024
0.024
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    endWalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
0.0005
0.0015
0.0025
0.0035
0.0005
0.0015
0.0025
0.0035
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
