examples/coOptimiseChannelAndBody/0/T
FoamFile { version 2.0; format ascii; class volScalarField; object T; }
dimensions [0 0 0 1 0 0 0];
internalField uniform 300;
boundaryField
{
    inlet         { type fixedValue; value uniform 300; }
    outlet        { type zeroGradient; }
    heatedSurface { type fixedGradient; gradient uniform 150; }
    bottomWall    { type zeroGradient; }
    endWalls      { type zeroGradient; }
    frontAndBack  { type empty; }
}
