examples/coOptimiseChannelAndBody/0/alpha
FoamFile { version 2.0; format ascii; class volScalarField; object alpha; }
dimensions [0 0 0 0 0 0 0];
internalField nonuniform List<scalar>
1920
(
1
1
1
1
1
1
1
1
...
)
;
boundaryField
{
    ".*" { type zeroGradient; }
    frontAndBack { type empty; }
}
