examples/coOptimiseChannelAndBody/constant/adjointRASProperties
FoamFile { version 2.0; format ascii; class dictionary; object adjointRASProperties; }
adjointRASModel  adjointLaminar;
adjointTurbulence on;
