examples/coOptimiseChannelAndBody/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

// Generic cooled-component slab, 2D. Nothing here is taken from any specific
// component geometry: it is a heated top surface, a protected solid crust
// beneath it, a conductive base, and a core in which a coolant path and the
// surrounding conductive body are BOTH free to be designed.
//
//   y=0.024  +-----------------------------------------+  heatedSurface (fixed heat flux)
//            |             crust  (FIXED SOLID)        |
//   y=0.020  +-----------------------------------------+
//            |          upper body  (DESIGN)           |
//   y=0.016  +======+---------------------------+======+
//     inlet ->      |      channel (DESIGN)      |      -> outlet
//   y=0.008  +======+---------------------------+======+
//            |          lower body  (DESIGN)          |
//   y=0.004  +-----------------------------------------+
//            |              base  (FIXED SOLID)        |
//   y=0      +-----------------------------------------+  bottomWall (adiabatic)
//          x=0    x=0.012                    x=0.108   x=0.12
//                 |<-- plugs -->|         |<-- plugs -->|   (FIXED FLUID)
//
// The design space is the whole core (x 0.012-0.108, y 0.004-0.020): the
// optimiser may put solid or fluid anywhere in it, so the coolant path and
// the conductive body co-evolve in one design field.

scale 1;

vertices
(
    // z = 0
    (0     0      0)  (0.12  0      0)      //  0  1
    (0     0.004  0)  (0.12  0.004  0)      //  2  3
    (0     0.008  0)  (0.12  0.008  0)      //  4  5
    (0     0.016  0)  (0.12  0.016  0)      //  6  7
    (0     0.020  0)  (0.12  0.020  0)      //  8  9
    (0     0.024  0)  (0.12  0.024  0)      // 10 11
    // z = 0.001
    (0     0      0.001)  (0.12  0      0.001)   // 12 13
    (0     0.004  0.001)  (0.12  0.004  0.001)   // 14 15
    (0     0.008  0.001)  (0.12  0.008  0.001)   // 16 17
    (0     0.016  0.001)  (0.12  0.016  0.001)   // 18 19
    (0     0.020  0.001)  (0.12  0.020  0.001)   // 20 21
    (0     0.024  0.001)  (0.12  0.024  0.001)   // 22 23
);

blocks
(
    hex ( 0  1  3  2 12 13 15 14) (80  4 1) simpleGrading (1 1 1)  // base
    hex ( 2  3  5  4 14 15 17 16) (80  4 1) simpleGrading (1 1 1)  // lower body
    hex ( 4  5  7  6 16 17 19 18) (80  8 1) simpleGrading (1 1 1)  // channel
    hex ( 6  7  9  8 18 19 21 20) (80  4 1) simpleGrading (1 1 1)  // upper body
    hex ( 8  9 11 10 20 21 23 22) (80  4 1) simpleGrading (1 1 1)  // crust
);

edges ();

boundary
(
    // Coolant enters and leaves only through the channel band, so the
    // optimiser can never seal the domain off from its inlet.
    inlet
    {
        type patch;
        faces (( 4 16 18  6));
    }
    outlet
    {
        type patch;
        faces (( 5  7 19 17));
    }
    heatedSurface
    {
        type wall;
        faces ((10 22 23 11));
    }
    bottomWall
    {
        type wall;
        faces (( 0  1 13 12));
    }
    endWalls
    {
        type wall;
        faces
        (
            ( 0 12 14  2) ( 1  3 15 13)     // base    west, east
            ( 2 14 16  4) ( 3  5 17 15)     // lower body
            ( 6 18 20  8) ( 7  9 21 19)     // upper body
            ( 8 20 22 10) ( 9 11 23 21)     // crust
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            ( 0  2  3  1) ( 2  4  5  3) ( 4  6  7  5) ( 6  8  9  7) ( 8 10 11  9)
            (12 13 15 14) (14 15 17 16) (16 17 19 18) (18 19 21 20) (20 21 23 22)
        );
    }
);
