examples/coOptimiseChannelAndBody/system/fvSchemes
FoamFile { version 2.0; format ascii; class dictionary; object fvSchemes; }
ddtSchemes { default steadyState; }
gradSchemes { default Gauss linear; gradConv cellLimited Gauss linear 1; }
divSchemes
{
    default         none;
    div(phi,U)      bounded Gauss upwind;
    div(-phi,Ua)    bounded Gauss upwind;
    div(-phi,Uaas1) bounded Gauss upwind;
    div(-phi,Uadp)  bounded Gauss upwind;
    div(phi,T)      bounded Gauss upwind;
    div(-phi,Ta)    bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div((nuaEff*dev2(T(grad(Ua))))) Gauss linear;
    "div\(\(nuEff\*dev\(T\(grad\(Ua.*\)\)\)\)\)" Gauss linear;
    "div\(\(nuaEff\*dev2\(T\(grad\(Ua.*\)\)\)\)\)" Gauss linear;
    div((nuEff*dev(T(grad(Ua)))))   Gauss linear;
    div((nuEff*dev2(T(grad(Ua)))))  Gauss linear;
    div((nu*dev(T(grad(Ua)))))      Gauss linear;
    div((nuEff*dev(T(grad(U)))))    Gauss linear;
}
laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes { default corrected; }
wallDist { method meshWave; }
